data/Log/Simultaneous/app_perf/setup3/mongol_runfinal.out
java -cp /home/ubuntu/ycsb/mongodb-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/core-0.12.0.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongo-java-driver-3.0.3.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-binding-0.12.0.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb/mongodb-binding/lib/slf4j-api-1.6.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.220:27017/ycsb?w=0 -p maxexecutiontime=600 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.220:27017/ycsb?w=0 -p maxexecutiontime=600 -t
Loading workload...
Starting test.
Maximum execution time specified as: 600 secs
2017-06-25 17:50:38:735 0 sec: 0 operations; est completion in 0 seconds 
mongo client connection created with mongodb://10.0.3.220:27017/ycsb?w=0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-06-25 17:50:48:697 10 sec: 1349 operations; 134.9 current ops/sec; est completion in 20 hours 35 minutes [READ: Count=1349, Max=247679, Min=211, Avg=6968.79, 90=20783, 99=41407, 99.9=177535, 99.99=247679] 
2017-06-25 17:50:58:697 20 sec: 2935 operations; 158.6 current ops/sec; est completion in 18 hours 55 minutes [READ: Count=1586, Max=244095, Min=188, Avg=6270.4, 90=20575, 99=37599, 99.9=66623, 99.99=244095] 
2017-06-25 17:51:08:697 30 sec: 4552 operations; 161.7 current ops/sec; est completion in 18 hours 17 minutes [READ: Count=1617, Max=82623, Min=173, Avg=6176.21, 90=20175, 99=36543, 99.9=49663, 99.99=82623] 
2017-06-25 17:51:18:697 40 sec: 6387 operations; 183.5 current ops/sec; est completion in 17 hours 23 minutes [READ: Count=1835, Max=62463, Min=159, Avg=5415.96, 90=19471, 99=38271, 99.9=55359, 99.99=62463] 
2017-06-25 17:51:28:697 50 sec: 8136 operations; 174.9 current ops/sec; est completion in 17 hours 3 minutes [READ: Count=1749, Max=77823, Min=143, Avg=5716.84, 90=19711, 99=36479, 99.9=48671, 99.99=77823] 
java -cp /home/ubuntu/ycsb/mongodb-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/core-0.12.0.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongo-java-driver-3.0.3.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-binding-0.12.0.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb/mongodb-binding/lib/slf4j-api-1.6.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.220:27017/ycsb?w=0 -p maxexecutiontime=600 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.220:27017/ycsb?w=0 -p maxexecutiontime=600 -t
Loading workload...
Starting test.
Maximum execution time specified as: 600 secs
2017-06-25 17:52:36:273 0 sec: 0 operations; est completion in 0 seconds 
mongo client connection created with mongodb://10.0.3.220:27017/ycsb?w=0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-06-25 17:52:46:238 10 sec: 1466 operations; 146.59 current ops/sec; est completion in 18 hours 56 minutes [READ: Count=1466, Max=367615, Min=193, Avg=6310.85, 90=19487, 99=45311, 99.9=76799, 99.99=367615] 
2017-06-25 17:52:56:238 20 sec: 3116 operations; 165 current ops/sec; est completion in 17 hours 49 minutes [READ: Count=1650, Max=200063, Min=183, Avg=6123.51, 90=20143, 99=43743, 99.9=80639, 99.99=200063] 
2017-06-25 17:53:06:238 30 sec: 4765 operations; 164.9 current ops/sec; est completion in 17 hours 28 minutes [READ: Count=1649, Max=95039, Min=187, Avg=6053.62, 90=20671, 99=44607, 99.9=79167, 99.99=95039] 
2017-06-25 17:53:16:238 40 sec: 6411 operations; 164.6 current ops/sec; est completion in 17 hours 19 minutes [READ: Count=1646, Max=256255, Min=167, Avg=6058.36, 90=19903, 99=43455, 99.9=64031, 99.99=256255] 
2017-06-25 17:53:26:238 50 sec: 8245 operations; 183.4 current ops/sec; est completion in 16 hours 49 minutes [READ: Count=1834, Max=142591, Min=158, Avg=5432.29, 90=19295, 99=42623, 99.9=67135, 99.99=142591] 
2017-06-25 17:53:36:238 60 sec: 10228 operations; 198.3 current ops/sec; est completion in 16 hours 16 minutes [READ: Count=1983, Max=83839, Min=152, Avg=5019.69, 90=18255, 99=41823, 99.9=69631, 99.99=83839] 
2017-06-25 17:53:46:238 70 sec: 12313 operations; 208.5 current ops/sec; est completion in 15 hours 46 minutes [READ: Count=2085, Max=74751, Min=150, Avg=4786.99, 90=18191, 99=33375, 99.9=56223, 99.99=74751] 
2017-06-25 17:53:56:238 80 sec: 14408 operations; 209.5 current ops/sec; est completion in 15 hours 24 minutes [READ: Count=2095, Max=220415, Min=150, Avg=4746.26, 90=18015, 99=37183, 99.9=77759, 99.99=220415] 
2017-06-25 17:54:06:238 90 sec: 16416 operations; 200.8 current ops/sec; est completion in 15 hours 12 minutes [READ: Count=2008, Max=93439, Min=149, Avg=4981.01, 90=18831, 99=37183, 99.9=61311, 99.99=93439] 
2017-06-25 17:54:16:238 100 sec: 18793 operations; 237.7 current ops/sec; est completion in 14 hours 45 minutes [READ: Count=2377, Max=75647, Min=142, Avg=4198.76, 90=16719, 99=35615, 99.9=63839, 99.99=75647] 
2017-06-25 17:54:26:238 110 sec: 21128 operations; 233.5 current ops/sec; est completion in 14 hours 25 minutes [READ: Count=2335, Max=225919, Min=138, Avg=4277.91, 90=16687, 99=35199, 99.9=70207, 99.99=225919] 
2017-06-25 17:54:36:238 120 sec: 23467 operations; 233.9 current ops/sec; est completion in 14 hours 10 minutes [READ: Count=2339, Max=75455, Min=139, Avg=4267.5, 90=17183, 99=32543, 99.9=59679, 99.99=75455] 
2017-06-25 17:54:46:238 130 sec: 25739 operations; 227.2 current ops/sec; est completion in 13 hours 59 minutes [READ: Count=2272, Max=165631, Min=150, Avg=4400.88, 90=17375, 99=32767, 99.9=67647, 99.99=165631] 
2017-06-25 17:54:56:238 140 sec: 28166 operations; 242.7 current ops/sec; est completion in 13 hours 46 minutes [READ: Count=2427, Max=162687, Min=149, Avg=4114.66, 90=16399, 99=31119, 99.9=81535, 99.99=162687] 
2017-06-25 17:55:06:238 150 sec: 30596 operations; 243 current ops/sec; est completion in 13 hours 34 minutes [READ: Count=2430, Max=67903, Min=141, Avg=4108.76, 90=16799, 99=33151, 99.9=58207, 99.99=67903] 
2017-06-25 17:55:16:238 160 sec: 33207 operations; 261.1 current ops/sec; est completion in 13 hours 20 minutes [READ: Count=2611, Max=91903, Min=145, Avg=3815.37, 90=14887, 99=33759, 99.9=55583, 99.99=91903] 
2017-06-25 17:55:26:238 170 sec: 35740 operations; 253.3 current ops/sec; est completion in 13 hours 9 minutes [READ: Count=2533, Max=138751, Min=146, Avg=3947.98, 90=15991, 99=32543, 99.9=54367, 99.99=138751] 
2017-06-25 17:55:36:238 180 sec: 38395 operations; 265.5 current ops/sec; est completion in 12 hours 58 minutes [READ: Count=2655, Max=139775, Min=151, Avg=3760.54, 90=15391, 99=31119, 99.9=69695, 99.99=139775] 
2017-06-25 17:55:46:238 190 sec: 41201 operations; 280.6 current ops/sec; est completion in 12 hours 45 minutes [READ: Count=2806, Max=153599, Min=149, Avg=3561.53, 90=14799, 99=30415, 99.9=49375, 99.99=153599] 
2017-06-25 17:55:56:238 200 sec: 44163 operations; 296.2 current ops/sec; est completion in 12 hours 31 minutes [READ: Count=2962, Max=82367, Min=150, Avg=3364.79, 90=13103, 99=31119, 99.9=51743, 99.99=82367] 
2017-06-25 17:56:06:238 210 sec: 47100 operations; 293.7 current ops/sec; est completion in 12 hours 19 minutes [READ: Count=2937, Max=224767, Min=169, Avg=3402.14, 90=13263, 99=28255, 99.9=56031, 99.99=224767] 
2017-06-25 17:56:16:238 220 sec: 50501 operations; 340.1 current ops/sec; est completion in 12 hours 2 minutes [READ: Count=3401, Max=73535, Min=172, Avg=2937.71, 90=10975, 99=28367, 99.9=50655, 99.99=73535] 
2017-06-25 17:56:26:238 230 sec: 53768 operations; 326.7 current ops/sec; est completion in 11 hours 49 minutes [READ: Count=3267, Max=90559, Min=174, Avg=3054.13, 90=11503, 99=28255, 99.9=60575, 99.99=90559] 
2017-06-25 17:56:36:238 240 sec: 57155 operations; 338.7 current ops/sec; est completion in 11 hours 35 minutes [READ: Count=3387, Max=121151, Min=173, Avg=2942.82, 90=11143, 99=28159, 99.9=50975, 99.99=121151] 
2017-06-25 17:56:46:238 250 sec: 60710 operations; 355.5 current ops/sec; est completion in 11 hours 22 minutes [READ: Count=3555, Max=76415, Min=170, Avg=2808.72, 90=9711, 99=26559, 99.9=44191, 99.99=76415] 
2017-06-25 17:56:56:238 260 sec: 64253 operations; 354.3 current ops/sec; est completion in 11 hours 10 minutes [READ: Count=3543, Max=270847, Min=172, Avg=2822.29, 90=9727, 99=26415, 99.9=42207, 99.99=270847] 
2017-06-25 17:57:06:238 270 sec: 68585 operations; 433.2 current ops/sec; est completion in 10 hours 51 minutes [READ: Count=4332, Max=68223, Min=172, Avg=2305.39, 90=4603, 99=24319, 99.9=47935, 99.99=68223] 
2017-06-25 17:57:16:238 280 sec: 72324 operations; 373.9 current ops/sec; est completion in 10 hours 40 minutes [READ: Count=3739, Max=74367, Min=170, Avg=2667.79, 90=6547, 99=29503, 99.9=65087, 99.99=74367] 
2017-06-25 17:57:26:238 290 sec: 76410 operations; 408.6 current ops/sec; est completion in 10 hours 27 minutes [READ: Count=4086, Max=223743, Min=151, Avg=2444.22, 90=4543, 99=23375, 99.9=47839, 99.99=223743] 
2017-06-25 17:57:36:238 300 sec: 80623 operations; 421.3 current ops/sec; est completion in 10 hours 15 minutes [READ: Count=4213, Max=62239, Min=156, Avg=2371.69, 90=4279, 99=24879, 99.9=41215, 99.99=62239] 
2017-06-25 17:57:46:238 310 sec: 85074 operations; 445.1 current ops/sec; est completion in 10 hours 2 minutes [READ: Count=4451, Max=62559, Min=149, Avg=2242.3, 90=3973, 99=23983, 99.9=43039, 99.99=62559] 
2017-06-25 17:57:56:238 320 sec: 89740 operations; 466.6 current ops/sec; est completion in 9 hours 48 minutes [READ: Count=4666, Max=63711, Min=142, Avg=2141.38, 90=3773, 99=23887, 99.9=42143, 99.99=63711] 
2017-06-25 17:58:06:238 330 sec: 94418 operations; 467.8 current ops/sec; est completion in 9 hours 37 minutes [READ: Count=4678, Max=80255, Min=139, Avg=2133.95, 90=3593, 99=23039, 99.9=35711, 99.99=80255] 
2017-06-25 17:58:16:238 340 sec: 99022 operations; 460.4 current ops/sec; est completion in 9 hours 26 minutes [READ: Count=4604, Max=233215, Min=155, Avg=2168.09, 90=3661, 99=22703, 99.9=38111, 99.99=233215] 
2017-06-25 17:58:26:238 350 sec: 104088 operations; 506.6 current ops/sec; est completion in 9 hours 14 minutes [READ: Count=5066, Max=50559, Min=156, Avg=1968.38, 90=3305, 99=21631, 99.9=32463, 99.99=47999] 
2017-06-25 17:58:36:238 360 sec: 109389 operations; 530.1 current ops/sec; est completion in 9 hours 2 minutes [READ: Count=5301, Max=64927, Min=154, Avg=1883.4, 90=2805, 99=21743, 99.9=35167, 99.99=50463] 
2017-06-25 17:58:46:238 370 sec: 115112 operations; 572.3 current ops/sec; est completion in 8 hours 49 minutes [READ: Count=5723, Max=52095, Min=171, Avg=1744.7, 90=2645, 99=21199, 99.9=37727, 99.99=51423] 
2017-06-25 17:58:56:238 380 sec: 120825 operations; 571.3 current ops/sec; est completion in 8 hours 37 minutes [READ: Count=5713, Max=233215, Min=169, Avg=1746.5, 90=2529, 99=21199, 99.9=37119, 99.99=56799] 
2017-06-25 17:59:06:238 390 sec: 126589 operations; 576.4 current ops/sec; est completion in 8 hours 26 minutes [READ: Count=5764, Max=100735, Min=151, Avg=1732.8, 90=2593, 99=20255, 99.9=33439, 99.99=47071] 
2017-06-25 17:59:16:238 400 sec: 132904 operations; 631.5 current ops/sec; est completion in 8 hours 14 minutes [READ: Count=6315, Max=48927, Min=149, Avg=1579.78, 90=2483, 99=18943, 99.9=30415, 99.99=40607] 
2017-06-25 17:59:26:238 410 sec: 139185 operations; 628.1 current ops/sec; est completion in 8 hours 4 minutes [READ: Count=6281, Max=219647, Min=149, Avg=1587.55, 90=2371, 99=18815, 99.9=38719, 99.99=63711] 
2017-06-25 17:59:36:238 420 sec: 145394 operations; 620.9 current ops/sec; est completion in 7 hours 54 minutes [READ: Count=6209, Max=73151, Min=147, Avg=1608.67, 90=2527, 99=19951, 99.9=33567, 99.99=49695] 
2017-06-25 17:59:46:238 430 sec: 152270 operations; 687.6 current ops/sec; est completion in 7 hours 43 minutes [READ: Count=6876, Max=57183, Min=146, Avg=1450.87, 90=2287, 99=18079, 99.9=34367, 99.99=52447] 
2017-06-25 17:59:56:238 440 sec: 159198 operations; 692.8 current ops/sec; est completion in 7 hours 33 minutes [READ: Count=6928, Max=52735, Min=149, Avg=1440.06, 90=2421, 99=15663, 99.9=31199, 99.99=48735] 
2017-06-25 18:00:06:238 450 sec: 166356 operations; 715.8 current ops/sec; est completion in 7 hours 23 minutes [READ: Count=7158, Max=171647, Min=149, Avg=1392.35, 90=2295, 99=15335, 99.9=29391, 99.99=44607] 
2017-06-25 18:00:16:238 460 sec: 173669 operations; 731.3 current ops/sec; est completion in 7 hours 13 minutes [READ: Count=7313, Max=45311, Min=147, Avg=1365.25, 90=2301, 99=15207, 99.9=25951, 99.99=44383] 
2017-06-25 18:00:26:238 470 sec: 180191 operations; 652.2 current ops/sec; est completion in 7 hours 6 minutes [READ: Count=6522, Max=47679, Min=144, Avg=1529.73, 90=3467, 99=15239, 99.9=29151, 99.99=39871] 
2017-06-25 18:00:36:238 480 sec: 183000 operations; 280.9 current ops/sec; est completion in 7 hours 9 minutes [READ: Count=2809, Max=34495, Min=147, Avg=3558.16, 90=6663, 99=18207, 99.9=29775, 99.99=34495] 
2017-06-25 18:00:46:238 490 sec: 190842 operations; 784.2 current ops/sec; est completion in 6 hours 59 minutes [READ: Count=7842, Max=102143, Min=138, Avg=1272.42, 90=2213, 99=14103, 99.9=30159, 99.99=77759] 
2017-06-25 18:00:56:238 500 sec: 198894 operations; 805.2 current ops/sec; est completion in 6 hours 50 minutes [READ: Count=8052, Max=43903, Min=148, Avg=1238.71, 90=2145, 99=13479, 99.9=28303, 99.99=41343] 
2017-06-25 18:01:06:238 510 sec: 206668 operations; 777.4 current ops/sec; est completion in 6 hours 42 minutes [READ: Count=7774, Max=84607, Min=143, Avg=1282.86, 90=2309, 99=13311, 99.9=27743, 99.99=70079] 
2017-06-25 18:01:16:238 520 sec: 214752 operations; 808.4 current ops/sec; est completion in 6 hours 34 minutes [READ: Count=8084, Max=227199, Min=149, Avg=1233.33, 90=2303, 99=11967, 99.9=25935, 99.99=35135] 
2017-06-25 18:01:26:238 530 sec: 222893 operations; 814.1 current ops/sec; est completion in 6 hours 27 minutes [READ: Count=8141, Max=50399, Min=152, Avg=1225.61, 90=2315, 99=9999, 99.9=24095, 99.99=45567] 
2017-06-25 18:01:36:238 540 sec: 231957 operations; 906.4 current ops/sec; est completion in 6 hours 19 minutes [READ: Count=9064, Max=44639, Min=152, Avg=1099.97, 90=1873, 99=7815, 99.9=22463, 99.99=35711] 
2017-06-25 18:01:46:238 550 sec: 240213 operations; 825.6 current ops/sec; est completion in 6 hours 12 minutes [READ: Count=8256, Max=34431, Min=146, Avg=1207.98, 90=2307, 99=9407, 99.9=24399, 99.99=31391] 
2017-06-25 18:01:56:238 560 sec: 249203 operations; 899 current ops/sec; est completion in 6 hours 5 minutes [READ: Count=8990, Max=106623, Min=150, Avg=1109.07, 90=1951, 99=6523, 99.9=21263, 99.99=48735] 
2017-06-25 18:02:06:238 570 sec: 258193 operations; 899 current ops/sec; est completion in 5 hours 58 minutes [READ: Count=8990, Max=68543, Min=151, Avg=1109.02, 90=2008, 99=6739, 99.9=22063, 99.99=44415] 
2017-06-25 18:02:16:238 580 sec: 267352 operations; 915.9 current ops/sec; est completion in 5 hours 51 minutes [READ: Count=9159, Max=40447, Min=146, Avg=1088.69, 90=2067, 99=6039, 99.9=20351, 99.99=34207] 
2017-06-25 18:02:26:238 590 sec: 276656 operations; 930.4 current ops/sec; est completion in 5 hours 45 minutes [READ: Count=9304, Max=39199, Min=150, Avg=1071.36, 90=1883, 99=5715, 99.9=23103, 99.99=37759] 
2017-06-25 18:02:36:238 600 sec: 285936 operations; 928 current ops/sec; est completion in 5 hours 39 minutes [READ: Count=9280, Max=45311, Min=150, Avg=1074.32, 90=1924, 99=5759, 99.9=23103, 99.99=39455] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2017-06-25 18:02:36:318 600 sec: 285954 operations; 225 current ops/sec; est completion in 5 hours 39 minutes [READ: Count=18, Max=64991, Min=171, Avg=4363.94, 90=1996, 99=64991, 99.9=64991, 99.99=64991] [CLEANUP: Count=1, Max=1601, Min=1601, Avg=1601, 90=1601, 99=1601, 99.9=1601, 99.99=1601] 
[OVERALL], RunTime(ms), 600084.0
[OVERALL], Throughput(ops/sec), 476.5232867398564
[TOTAL_GCS_PS_Scavenge], Count, 300.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 722.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.12031648902486985
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 300.0
[TOTAL_GC_TIME], Time(ms), 722.0
[TOTAL_GC_TIME_%], Time(%), 0.12031648902486985
[READ], Operations, 285954.0
[READ], AverageLatency(us), 2092.057733061961
[READ], MinLatency(us), 138.0
[READ], MaxLatency(us), 367615.0
[READ], 95thPercentileLatency(us), 11759.0
[READ], 99thPercentileLatency(us), 24143.0
[READ], Return=OK, 285954
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 1601.0
[CLEANUP], MinLatency(us), 1601.0
[CLEANUP], MaxLatency(us), 1601.0
[CLEANUP], 95thPercentileLatency(us), 1601.0
[CLEANUP], 99thPercentileLatency(us), 1601.0